#pragma once

#include <shared_mutex>
#include <atomic>
#include <mutex>
#include <limits>
#include "KeyCodeActor.h"
#include "BotwEdit.h"
#include <map>
#include "ActorData.h"
#include "Memory.h"
#include "dllmain_Variables.h"
#include "Entities.h"
#include "Game.h"

// This stuff here was yoinked from BetterVR
// -----------------------------------------
	extern union FPR_t {
		double fpr;
		struct
		{
			double fp0;
			double fp1;
		};
		struct
		{
			uint64_t guint;
		};
		struct
		{
			uint64_t fp0int;
			uint64_t fp1int;
		};
	};

	extern struct PPCInterpreter_t {
		uint32_t instructionPointer;
		uint32_t gpr[32];
		FPR_t fpr[32];
		uint32_t fpscr;
		uint8_t crNew[32]; // 0 -> bit not set, 1 -> bit set (upper 7 bits of each byte must always be zero) (cr0 starts at index 0, cr1 at index 4 ..)
		uint8_t xer_ca;  // carry from xer
		uint8_t LSQE;
		uint8_t PSE;
		// thread remaining cycles
		int32_t remainingCycles; // if this value goes below zero, the next thread is scheduled
		int32_t skippedCycles; // if remainingCycles is set to zero to immediately end thread execution, this value holds the number of skipped cycles
		struct
		{
			uint32_t LR;
			uint32_t CTR;
			uint32_t XER;
			uint32_t UPIR;
			uint32_t UGQR[8];
		}sprNew;
	};
	// -----------------------------------------

	typedef void (*osLib_registerHLEFunctionType)(const char* libraryName, const char* functionName, void(*osFunction)(PPCInterpreter_t* hCPU));


#pragma pack(push, 1)
	extern struct TransferableData { // This is reversed compared to the gfx pack because we read as big endian.
		int f_r10;
		int f_r9;
		int f_r8;
		int f_r7;
		int f_r6;
		int f_r5;
		int f_r4;
		int f_r3;

		int ringPtr;

		int fnAddr;
		int dispatchState;

		// patch_SpawnActors.asm aligns the following .int fields to four
		// bytes after its two one-byte flags.  Because this native structure
		// is stored in reverse order, those implicit PPC bytes live here.
		byte bytepadding[2];
		bool interceptRegisters;

		bool enabled;
	};

	extern struct InstanceData {
		char name[152]; // We'll allocate all unused storage for use for name storage.. just in case of a really long actor name
		uint8_t actorStorage[104];
	};
#pragma pack(pop)

// The PPC assembler aligns SpawnDispatchState to four bytes after Enabled and
// InterceptRegisters. With that dispatch word the storage is 48
// bytes. memory_writeMemoryBE() reverses this complete structure, so the
// native representation must retain the corresponding two padding bytes.
static_assert(sizeof(TransferableData) == 48, "Spawn transfer layout must match patch_SpawnActors.asm");
static_assert(offsetof(TransferableData, fnAddr) == 36, "Spawn function address offset changed");
static_assert(offsetof(TransferableData, dispatchState) == 40, "Spawn dispatch-state offset changed");
static_assert(offsetof(TransferableData, bytepadding) == 44, "Spawn alignment padding changed");
static_assert(offsetof(TransferableData, interceptRegisters) == 46, "Spawn intercept flag offset changed");
static_assert(offsetof(TransferableData, enabled) == 47, "Spawn enabled flag offset changed");
static_assert(sizeof(InstanceData) == 256, "Spawn instance ring entry must remain 256 bytes");

	extern struct QueueActor {
		float PosX;
		float PosY;
		float PosZ;
		std::string Name;
	};

	extern struct QueueAnimation {
		int playerNumber;
		uint32_t actorAddress;
		uint32_t animation;
	};

	extern struct QueueActorDelete {
		int playerNumber;
		uint32_t actorAddress;
	};

// ---------------------------------------------------------------------------------
// This is an example function call.
// - Feel free to expand / change -
// Note: This does not take into account stuff like actually setting desired params.
// ---------------------------------------------------------------------------------
std::map<char, std::vector<KeyCodeActor>> keyCodeMap;

std::shared_mutex keycode_mutex;
std::shared_mutex queue_mutex;
std::shared_mutex data_mutex;
std::mutex spawn_callback_mutex;

uint64_t spawn_request_sequence = 0;
uint64_t pending_spawn_sequence = 0;
int last_observed_dispatch_state = -1;
